export const validateParams = {
  lastName: {
    pattern: /^[А-я]{1,15}/,
    errorMessage: 'Поле Фамилия заполнено не верно. Пример - Михайлов'
  },
  firstName: {
    pattern: /^[А-я]{1,15}/,
    errorMessage: 'Поле Имя заполнено не верно. Пример - Стас'
  },
  patronymic: {
    pattern: /^[А-я]{1,15}/,
    errorMessage: 'Поле Отчество заполнено не верно. Пример - Михайлович'
  },
  dateOfBirth: {
    pattern: /(0[1-9]|1[0-9]|2[0-9]|3[01]).(0[1-9]|1[012]).[0-9]{4}/,
    errorMessage: 'Поле Дата рождения заполнено не верно. Пример - 01.01.2000'
  },
  passportSeries: {
    pattern: /[0-9]{1}[0-9]{1}[0-9]{1}[0-9]{1}/,
    errorMessage: 'Поле Серия паспорта заполнено не верно. Пример - 0 0 0 0'
  },
  passportNumber: {
    pattern: /[0-9]{1}[0-9]{1}[0-9]{1}[0-9]{1}[0-9]{1}[0-9]{1}/,
    errorMessage: 'Поле Номер паспорта заполнено не верно. Пример - 0 0 0 0 0 0'
  },
  birthCertificate: {
    pattern: /[0-9]{1}[0-9]{1}[0-9]{1}[0-9]{1} [А-я]{1}[А-я]{1} [0-9]{1}[0-9]{1}[0-9]{1}[0-9]{1}[0-9]{1}[0-9]{1}/,
    errorMessage: 'Номер свидетельства о рожденни указан некорректно. Пример: 1212 - ЫП - 123456'
  },
}